Autodesk.Revit.DB.ModelPath.GetProjectGUID
A GUID identifying Cloud Model project to which the cloud model is associated.
Since:
2012

Autodesk.Revit.DB.ModelPath.Region
The region of the cloud model.
Since:
2021